tutorials/2WayCouplingOceanWave3D/04_OCW3D+OF_BlendIn01Wl_BlendOut01Wl/constant/RASProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel        kOmegaSST;

turbulence      on;

printCoeffs     on;
