tutorials/2WayCouplingOceanWave3D/04_OCW3D+OF_BlendIn01Wl_BlendOut01Wl/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

solver              sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (WEC);
    innerDistance   0.05;
    outerDistance   20;

    centreOfMass    (0 0.025 0);
    momentOfInertia (99999999 99999999 99999999);
    mass            500.7;
    report          on;
    accelerationRelaxation 0.7;

    constraints
    {
	zAxis
	{
	    sixDoFRigidBodyMotionConstraint line;
	    direction    (0 0 1);
	}
     }
       
}
