tutorials/2WayCouplingOceanWave3D/04_OCW3D+OF_BlendIn01Wl_BlendOut01Wl/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 6;

method          simple;

simpleCoeffs
{
    n               (6 1 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               8_Split;
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots           ( );
