tutorials/2WayCouplingOceanWave3D/04_OCW3D+OF_BlendIn01Wl_BlendOut01Wl/system/topoSetDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
             box (-1000 0 -7.2) (2000 5 10);
        }
    }
    {
        name    probes;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-999 -999 -3) (100 999 3);
        }
    }

    {
        name    probes;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set probes;
        }
    }
);

// ************************************************************************* //
